Revit 2023 API
RebarContainerParameterManager.RemoveOverride Method
 Removes an overridden value from the given parameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2016
Syntax
C#
public void RemoveOverride(
	ElementId paramId
)
Visual Basic
Public Sub RemoveOverride ( _
	paramId As ElementId _
)
Visual C++
public:
void RemoveOverride(
	ElementId^ paramId
)
Parameters
paramId
Type: Autodesk.Revit.DB.ElementId
 The id of the parameter
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  paramId has no override
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
See Also
RebarContainerParameterManager Class
Autodesk.Revit.DB.Structure Namespace